-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Мар 18 2024 г., 23:57
-- Версия сервера: 8.0.30
-- Версия PHP: 7.2.34

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `accountingDB`
--

-- --------------------------------------------------------

--
-- Структура таблицы `list_extinguishers`
--

CREATE TABLE `list_extinguishers` (
  `id` bigint NOT NULL,
  `brand` varchar(255) DEFAULT NULL,
  `date_load` date DEFAULT NULL,
  `date_reload` date DEFAULT NULL,
  `department` varchar(255) DEFAULT NULL,
  `fio` varchar(255) DEFAULT NULL,
  `number` varchar(255) DEFAULT NULL,
  `place` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;

--
-- Дамп данных таблицы `list_extinguishers`
--

INSERT INTO `list_extinguishers` (`id`, `brand`, `date_load`, `date_reload`, `department`, `fio`, `number`, `place`) VALUES
(52, 'ОУ-3', '2020-09-01', '2025-09-01', 'СЗПГоК', 'Злобин АЕ', '1', 'Кабинет СЗПГК'),
(53, 'ОУ-3', '2019-04-01', '2024-04-01', 'СЗПГоК', 'Злобин АЕ', '2', 'Бокс №2'),
(54, 'ОП-9', '2021-05-01', '2026-05-01', 'СЗПГоК', 'Злобин АЕ', '3', 'Мастерская СЗПГК'),
(55, 'ОП-9', '2021-05-01', '2026-05-01', 'СЗПГоК', 'Злобин АЕ', '4', 'Мастерская СЗПГК'),
(56, 'ОП-10(3)-ABCE МИГ', '2019-05-01', '2024-05-01', 'СНГиСН', 'Горбатенко МВ', '1', 'мастерская службы Нг и СН (1 этаж)'),
(57, 'ОП-10(3)-ABCE МИГ', '2019-05-01', '2024-05-01', 'СНГиСН', 'Горбатенко МВ', '2', 'раздевалка ((возле душевой) 2 этаж)'),
(58, 'ОП-10(3)-ABCE МИГ', '2019-05-01', '2024-05-01', 'СНГиСН', 'Горбатенко МВ', '3', 'раздевалка ((возле умывальников) 2 этаж)'),
(59, 'ОП-10(3)-ABCE МИГ', '2019-05-01', '2024-05-01', 'СНГиСН', 'Горбатенко МВ', '4', 'под лестницей (1 этаж)'),
(60, 'ОП-10(3)-ABCE МИГ', '2019-05-01', '2024-05-01', 'СНГиСН', 'Горбатенко МВ', '5', 'кабинет мастеров №4 (2 этаж)'),
(61, 'ОП-10(3)-ABCE МИГ', '2019-05-01', '2024-05-01', 'СНГиСН', 'Горбатенко МВ', '6', 'Учебно-практический класс (3 этаж)'),
(62, 'ОП-10(3)-ABCE МИГ', '2019-05-01', '2024-05-01', 'СНГиСН', 'Горбатенко МВ', '7', 'актовый зал (3 этаж)'),
(63, 'ОП-10(3)-ABCE МИГ', '2019-05-01', '2024-05-01', 'СНГиСН', 'Горбатенко МВ', '8', 'кабинет охраны труда (3 этаж)'),
(64, 'ОП-10(3)-ABCE МИГ', '2021-05-01', '2026-05-01', 'СНГиСН', 'Горбатенко МВ', '18', 'раздевалка ((возле сушилки) 2 этаж)'),
(65, 'ОП-4(3)-ABCE МИГ', '2023-07-01', '2028-07-01', 'СНГиСН', 'Горбатенко МВ', 'Бокс 7', 'Бокс 7'),
(66, 'ОП-4(3)-ABCE МИГ', '2023-08-01', '2028-08-01', 'СНГиСН', 'Горбатенко МВ', 'Бокс 8', 'Бокс 8'),
(67, 'ОП-4(3)-ABCE МИГ', '2023-07-01', '2028-07-01', 'СНГиСН', 'Горбатенко МВ', 'Бокс 14', 'Бокс 14'),
(68, 'ОП-4(3)-ABCE МИГ', '2023-07-01', '2028-07-01', 'СНГиСН', 'Горбатенко МВ', 'Бокс 15', 'Бокс 15'),
(69, 'ОП-4(3)-ABCE МИГ', '2023-08-01', '2028-08-01', 'СНГиСН', 'Горбатенко МВ', 'Бокс 17', 'Бокс 17'),
(70, 'ОП-4(3)-ABCE МИГ', '2023-07-01', '2028-07-01', 'СНГиСН', 'Горбатенко МВ', 'Бокс 19', 'Бокс 19'),
(71, 'ОП-10(3)-ABCE МИГ', '2023-06-01', '2028-06-01', 'СНГиСН', 'Горбатенко МВ', 'Бокс 17.1', 'Бокс №17 (для газоопасных работ)'),
(72, 'ОП-10(3)-ABCE МИГ', '2023-06-01', '2028-06-01', 'СНГиСН', 'Горбатенко МВ', 'Бокс 17.2', 'Бокс №17 (для газоопасных работ)');

-- --------------------------------------------------------

--
-- Структура таблицы `list_extinguishers_seq`
--

CREATE TABLE `list_extinguishers_seq` (
  `next_val` bigint DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;

--
-- Дамп данных таблицы `list_extinguishers_seq`
--

INSERT INTO `list_extinguishers_seq` (`next_val`) VALUES
(151);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `list_extinguishers`
--
ALTER TABLE `list_extinguishers`
  ADD PRIMARY KEY (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
